import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class DataService {
 
  items=[
    {
      id: 'teaching',
      name: 'آموزش خانگی',
      image: 'tutor.png',
      info:`
      افزایش کار و کمبود وقت مانع رفتن مردم به مراکز آموزشی شده است، و اکثر مردم بخاطر نبود وقت کافی از ادامه تحصیل باز می مانند که این یک مشکل اساسی پنداشته می شود، لذا ما براین شدیم تا فضای را ایجاد نمایم که دیگر هیچ یک از هموطنان ما از تحصیل و ارتقا دادن سطح دانش شان باز نماند. 
      ما با راه اندازی اپلیکشن کارگر آموزش خانگی را در کشور نهادینه کردیم. شما میتوانید با استفاده از این برنامه در منزل و محیط کار تان استادان ماهر و با تجربه را جهت ارتفای تخصص فعلی و یا یادگیری تخصص جدید درخواست نمائید
      `,
      category:`
      1. آموزش زبان خارجی
      2. آموزش پروگرام های کمپیوتر
      3. آموزش پروگرام های مالی و حسابداری
      4. آمادگی اختصاصی کانکور
      5. آموزش مضامین مکاتب



      `
    },

    {
      id: 'education',
      name: ' تحصیلی و بورسیه',
      image: 'education.png',
      info:`
      تحصیلات یک رکن اساسی و مهم برای بهبود وضعیت زندگی و موقعیت شغلی هر فرد جامعه می باشد. همچنان رویای هرفرد است که با امکانات بهتر در دانشگاه های معتبر در خارج از کشور تحصیل نمایند.
      اما نتیجه تحصیلات همگی رضایت بخش نمی باشند، چون تحصیلات هم از خود راه و روش منحصر بخودش را دارد. اگر می خواهید نتیجه تحصیلات تان رضایت بخش و موثر واقع شود، تیم مسلکی ما در بخش های مختلف آماده¬ی هر نوع همکاری با شما می باشند.

    `,
      category:`
      1. مشاوره تحصیلی
      2. ثبت نام بورسیه ها
      3. مونوگراف نویسی
      4. پروپوزل نویسی


      
      `
    },
    {
      id: 'ambulance',
      name: 'امبولانس',
      image: 'ambulance.png',
      info:`
      برای یک مریض بهمان پیمانه که داکتر و دوا ضروری و مهم می باشد، رساندن مریض به شفاخانه نیز اهمیت دارد.
      لذا برای رساندن مریض تان به شفاخانه بزودترین زمان ممکن باما به تماس شوید.
`,
      category:`

      `
    },

    {
      id: 'translation',
      name: 'ترجمان، و ترجمه',
      image: 'translator.png',
      info:` صحبت کردن به زبان های خارجی جهت پیش برد تجارت، تداوی مریض و غیره امور زندگی یکی از ضروریات اساسی امروز می باشد.
      اما بلدیت به تمام زبان های رایج در جهان امکان برای هرشخص امکان پذیر نیست. ما با تیم کاری مسلکی در زمینه ترجمانی، ترجمه اسناد به شما خوبان همکاری خوب کرده می توانیم. 
      جهت مستفید شدن از خدمات زیر با ما به تماس شوید.
      `,
      category:`
      1. ترجمانی در داخل و خارج از کشور
      2. ترجمه انواع اسناد ها

      

      
      `
    },

    {
      id: 'online',
      name: ' فورم های انلاین',
      image: 'formonline.png',
      info:`
      فورم های آنلاین باید دقیق، درست، بدون اشتباهات املایی و تایپی خانه پری گردد. و همچنین فورم های آنلاین چون بورسیه ها، ثبت نام لاتری ها نیاز به دانش، تخصص و مهارت خاص دارد. که هر شخص از عهده آن برآمده نمی¬تواند. 
      اگر فورم های آنلاین که می خواهید خانه پری نمائید بدون اشکالات و بی عیب و نقص باشد، تا فرصت بدست آمده را از دست ندهید، با ما به تماس شوید.

      `,
      category:`
      1. خانه پری فورم انلاین پاسسپورت
      2. خانه پری فورم آنلاین تذکره کاغذی و الکترونی
      3. خانه پری فورم های ویزه کشور های خارجی
      4. ثبت نام انواع لاتری، مانند گرین کارت امریکا



      `
    },

    {
      id: 'job',
      name: 'کاریابی',
      image: 'jobseeker.png',
      info:`
      وظیفه خوب و رویایی آرزوی هر فرد جامعه می باشد. اما در جامعه کنونی یافتن چنین وظیفه حتی اگر تخصص کامل در بخش مربوطه داشته باشیم، بازهم دشوار است. و این دلایل بس زیادی دارد.
      اگر میخواهید با تخصص که دارید به وظیفه و خواست رویایی تان برسید به ما ملحق شوید.
      
      `,
      category:`
      1. کارآفرینی
      2. ترتیب سی وی
      3. رهنمایی مصاحبه 
      


      `
    },

    {
      id: 'employee',
      name: 'کارمند یابی',
      image:'employee.png',
      imageinfo: 'کارمند دفاتر',
      info:`
      کارفرمایان عزیز دیگر نیاز نیست هرچند وقت کارمند خود را اخراج، و دنبال کارمند با توانایی و لیاقت بهترتر بگردید. ما یک بار برای همیشه متخصص ورزیده را به شما معرفی می نمائیم. 
      اگر دنبال کارمند ورزیده و متخصص هستید به ما به تماس شوید.

      `,
      category:`
      1. کارمند مالی و اداری
      2. کارمند آی تی و دیتابیس
      3. کارمند تدارکاتی و مالیاتی
      4. کارمند فروشات و بازاریابی


      `
    },

    {
      id: 'computer',
      name: 'خدمات کمپیوتری',
      image: 'computer.png',
      imageinfo: 'خدمات کمپیوتری',
      info:`
      کمپیوتر نقش بسیار مهم و موثر در راستای تامین امنیت، سرعت، دقت، اطمینان بیشتر در اجراء و محاسبات مالی در امور تجارت و زندگی شخصی ایفا می نماید. 
      پس اگر می خواهید از خدمات زیر به زودترین فرصت ممکن و با اطمینان بیشتر مستفید شوید به ما به تماس شوید.

`,
      category:`
      1. ترمیم و راه اندازی سیستم دفاتر
      2. نصب و راه اندازی کمره های امنیتی
      3.  خدمات آی تی
      4. خدمات دیتابیس
      5. ترمیم کمپیوتر
      6. دیزاین و چاپ لوگو، ویزیت کارت و بروشور


      `
    },

    {
      id: 'dish',
      name: ' انترنت، دیش آنتن',
      image: 'internet.png',
      imageinfo: 'نصب ماهواره',
      info:`
      کیفیت سیگنال انترنت، دیش آنتن و ماهواره به راه اندازی و نصب درست آن بستگی دارد، ما خدمات زیر را به شما عزیزان پیشکش می نمایم. اگر می خواهید ازاین خدمات به صورت عالی و با کیفیت مستفید شوید به ما تماس بگیرید.
      `,
      category:`
      1. نصب و راه اندازی انترنت
      2. تنظیم و نصب دیش آنتن
      3. نصب آیفون های دروازه
      4. نصب و راه اندازی تلویزیون



      `
    },

    {
      id: 'camera',
      name: 'عکاسی وفلمبرداری',
      image: 'photography.png',
      imageinfo: 'عکسای و فلمبرداری',
      info:`
      عکاسی و فلمبرداری هنراست که افراد خاص و مسلکی دارا می باشد. اگر میخواهید خاطره¬ی جشن عروسی، نامزادی، شیرینی خوری و انواع سالگره تان با کیفیت عالی ماندگار شود، ما با تیم متشکل از خانم ها و آقایان در موارد زیر درخدمت شما مشتریان عزیز قرار داریم. 
      `,
      category:`
      1. عکسای و فلمبرداری از محافل
      2. چاپ و ویرایش عکس و فلم



      `
    },

    {
      id: 'nursing',
      name: 'پرستاری',
      image: 'nursing.png',
      imageinfo: 'پرستاری',
      info:`
      مراقبت از سالمندان، مریضان و کودکان امر واجب و ضروری بالای هر فرد جامعه می باشد. اما از طرف دیگر کار و وظیفه رفتن برای ادامه زندگی همچنان الزامی است. 
      اگر افراد سالمند، مریض و کودک در خانه دارید  که نیاز به مراقبت دارد، و خود هم نمی توانید بخاطر مراقبت از آنها وظیفه تان را ترک نمائید، بدون دلواپسی و نگرانی به وظیفه رفته، ما با تیم متشکل از خانم ها و آقایان در موارد زیر به شما مشتریان عزیز خدمات عالی را ارایه می نمائیم.
      `,
      category:`
      1. پرستاری از سالمندان
      2. پرستاری از کودکان و نوزادان
      3. پرستاری از مریضان



      `
    },

     {
      id: 'ٌbuilding',
      name: 'ساختمانی',
      image: 'building.png',
      info:`
      عمر یک ساختمان به درست، دقیق و باکیفیت کارکردن تمام بخش های آن مربوط می شود. اگر یکی از بخش های یک ساختمان درست اجراء نشود، از عمر ساختمان بدون شک کاسته می شود. 
      ما " تیم کارگر" با ارایه خدمات زیر از عمر و زیبایی ساختمان شما ضمانت می نمایم، اگر می خواهید ساختمان بناء نمائید که عمر دراز و در عین حال زیبا باشد با ما به تماس شوید.
      ما خدمات زیر را با کیفیت بالا و کمترین نرخ ممکن به شما ارایه می نمائیم.
      
      `,
      category:`
      1. نقشه کشی
      2. قالببندی، بتون ریزی و بنایی
      3. سنگ، مزایک، کاشی و سرامیک کاری
      4. سیمان کاری
      5. گج کاری
      6. 



      `
    },
    
    {
      id: 'facilities',
      name: 'تاسیسات',
      image: 'aircondition.png',
      info:`
      با آمدن تکنالوژی خیلی از امکانات فراهم شده است، که نمونه¬ای آن سیستم مرکز گرمی می باشد، که جهت گرم نمودن هوا اطاق¬ها بصورت استندارد و یکسان استفاده می شود. اگر دنبال استفاده چنین تکنالوژی های هستید ما خدمات زیر را برای شما ارایه میداریم.
      `,
      category:`
      1. خدمات نصب و راه اندازی مرکز گرمی
      2. ترمیم مرکز گرمی
      3. خدمات نصب و راه اندازی سرد سازی
      4. ترمیم کولر و ایرکندیشن



      `
    },

    {
      id: 'elec',
      name: 'برق کشی',
      image: 'electricity.png',
      imageinfo: 'برق کشی',
      info:`
      برق وسیله ی روشنایی و آورنده¬ی خیلی سهولت ها در امور زندگی بشر می باشد، اما با اندک غفلت باعث مرگ انسان ها و تخریب ساختمان ها میگردد. 
      اگر می خواهید سیستم برقی خوب، با کیفیت و مطمئین داشته باشید، به ما تماس گرفته از خدمات زیر مستفید شوید.

      `,
      category:`
      1. برق کشی مراکز تجارتی
      2. برق کشی آپارتمان
      3. برق کشی منازل مسکونی
      4. عیب و مشکل یابی برق



      `
    },

    {
      id: 'pipe',
      name: 'نل دوانی',
      image: 'plummber.png',
      imageinfo: 'نل دوانی',
      info:`
      رسانیدن آب منظم به تمام نقاط مورد استفاده آب، از خصوصیات یک نلدوانی خوب است، و همچنین یک نلدوانی غیر معیاری باعث بندش نل ها شده که سبب خرابی و نقصان زیاد میگردد. 
      اگر می خواهید ساختمان تان دارای یک نلدوانی معیاری و با کیفیت باشد که در آینده از خرابی، بندیش جلوگیری شود، ما چنین خدمات را به شما تحت عناوین زیر ارایه می نمائیم.

      `,
      category:`
      1. نلدوانی مراکز تجارتی
      2. نلدوانی آپارتمان
      3. نلدوانی منازل مسکونی
      4. عیب و مشکل یابی و ترمیم نل ها
      5. باز کردن نل ها
      


      `
    },

    {
      id: 'paint',
      name: 'رنگمالی',
      image: 'painting.png',
      info:`
      رنگ کردن دیوار ها، دروازه، پنجره و غیره تنها پاشیدن و مالیدن رنگ به سطح آن نمی باشد. بلکه رنگ کردن طوری باید صورت گیرد که از نگاه روان شناسی نیز مناسب باشد.
      رنگ و نحوه رنگ کردن اطاق مطالعه با اطاق خواب، اطاق خواب با سالون و سالون با اطاق اطفال فرق دارد، که باید هر کدام مطابق استندرد و معیارات خود شان رنگ گردد. 
      برای مستفید شدن از چنین استندرد ها به ما تماس بگیرید.

      `,
      category:`
      1. خدمات رنگ روغنی
      2. خدمات رنگ پلاستکی
      
    

      `
    },

    {
      id: 'decor',
      name: 'دیکوریشن',
      image: 'decoration.png',
      info:`
      نما (دیکور) داخلی و بیرونی دفاترو منازل برای آرامش خاطر و سهولت بیشتر یک نیاز است که باید خواسته یا نخواسته انجام شود. از طرف دیگر انجام این کار توسط افراد عادی، بی تجربه و بدون داشتن علم دیکوریشن نه تنها باعث آرامش خاطر نمی شود، بلکه بسیار خسته کننده هم می شود. 
      اگر می خواهید از ضایع شدن مواد دیکور جلوگیری نموده و یکبار برای همیشه از یک دیکوریشن عالی و با کیفیت برخوردار شوید، با ما تماس حاصل نماید.

      `,
      category:`
      1. کابنیت و کمود سازی
      2. مبل و فرنیجر
      3. کاغذ دیواری
      4. پرده سازی
      5. تایل های پلیمری، گچی و شیشه یی
      6. سقف های کشسان و کاذب
      7. انواع سنگ اصلی و مصنوعی
      8. کف پوش اپوکسی



      `
    },

    {
      id: 'welding',
      name: 'فلزکاری',
      image: 'welding.png',
      imageinfo: 'فلز کاری',
      info:`
      فلزکاری مهارت می خواهد که باید از آن برای دیزاین و ساختن ابزار فلزی بی عیب و نقص استفاده شود.
      اگر دنبال فلزکار خوب و حرفه ی هستید و می خواهید ابزار های فلزی تان بی عیب، نقص و نمای عالی ساخته شود، با ما به تماس شوید.
      
      `,
      category:`
      1. پنجره و دروازه فلز
      2. کتاره سازی
      3. جوشکاری



      `
    },

    {
      id: 'carpenter',
      name: 'نجاری',
      image: 'carpenter.png',
      imageinfo: 'نجار',
      info:`نجاری مهارت می خواهد که باید از آن برای دیزاین و ساختن وسایل چوبی، پی وی سی  و المونیمی بی عیب و نقص استفاده شود.
      اگر دنبال نجار خوب و حرفه ی هستید و می خواهید وسایل تان بی عیب، نقص و نمای عالی ساخته شود، با ما به تماس شوید.
      `,
      category:`
      1. دروازه و پنجره سازی چوبی
      2. دروازه و پنجزه سازی المونیمی
      3. دروازه و پنجره سازی پی وی سی
      4. دروازه و پنجره سازی فلزی
      5. میز، چوکی و غیره



      `
    },

    {
      id: 'repairing',
      name: 'ترمیمات',
      image: 'repairing.png',
      info:`وسایل برقی و گازی به مرور زمان از کار می افتد و نیاز به ترمیم دوباره دارد. ولی یافتن ترمیم کار ماهر و با تجربه که این خدمات را در منزل انجام دهد مشکل است.
      با امدن " کارگر " این مشکل بصورت صد فیصدی حل گردیده، و تمام مشتریان عزیز می توانند با یک تماس ترمیم کار ماهر و مجرب را در منزل بخواهند. 
      `,
      category:`
      1. ترمیم یخچال
      2. ترمیم بایلر گازی و برقی
      3. ترمیم وطو
      4. ترمیم ماشین خیاطی
      5. ترمیم وسایل برقی



      `
    },

    {
      id: 'taxi',
      name: ' تکسی رانی ',
      image: 'taxi.png',
      info:`درجامعه ما با وضعیت کنونی درخواست تکسی مطمئین، قیمت مناسب و اسرع وقت مشکل است. 
      با آمدن اپلیکشن "کارگر" این مشکل حل گردیده و شما می تواند بطور 24 ساعته از خدمات تکسی رانی بدون نگرانی و با آرامیش خاطر مستفید شوید. 
      `,
      category:`
      1. تکسی 24 ساعته دربستی داخل شهری
      2. تکسی 24 ساعته دربستی داخلی کشوری



      `
    },

    {
      id: 'washing',
      name: 'خشکه شویی',
      image: 'lundary.png',
      imageinfo: 'خشکه شویی',
      info:`
      "کارگر" خدمات خشکه شویی درب منزل را جهت سهولت هرچه بیشتر شما مشتریان عزیز ارایه می نماید.
      تمیز شستن، منظم وطو کردن و به موقع رساندن لباس های تان را با استفاده از اپلیکشن "کارگر" تجربه نماید.
      برای خدمات زیر بما تماس حاصل نماید.

      `,
      category:`
      1. شستشویی لباس های محلی
      2. شستشویی کوت شلوار
      3. شستشویی کمپل، قالین و موکیت



      `
    },

    {
      id: 'cooking',
      name: 'آشپزی',
      image: 'cooking.png',
      info:`تهیه غذا خوش مزه و با کیفیت و همچنین پذیرایی منظم از مهمانان نماد احترام گذاشتن به مهمانان است، که هر شخص تلاش می نماید برای مهمانان خود غذای خوش مزه و باکیفیت آماده نموده و پذیرایی خوب نماید. اما در اکثر مواقع خواسته یا نخواسته چنین نمی شود. و غذا آن چنان که باید تهیه می شد نمی شود. و یا در پذیرایی کمبودات و بی نظمی دیده می شود.
      شما مشتریان عزیز اگر می خواهید برای شما چنین واقعه پیش نیاید، و برای مهمانان تان غذای خوش مزه و باکیفیت تهیه نموده و همچنین از پذیرایی خاطر جمع باشید، بما تماس بگیرید. 
      ما خدمات زیر را با کیفیت عالی و نازل ترین قیمت برای شما اجرا می نمایم.
      `,
      category:`
      1. تهیه غذا از بیرون + پذیرایی
      2. پختن غذا در منزل مشتری + پذیرایی
      3. پذیرایی 


      `
    },

    {
      id: 'rahnama',
      name: 'رهنمایی معاملات',
      image: 'realstate.png',
      info:`اجرای یک معامله که در آن اطمینان و رضایت طرفین حاصل شود به آسانی صورت نمی گیرد، مگر از مشاوره و تخصص افراد متخصص استفاده شود. 
      برای اجرای یک معامله خوب با ما تماس حاصل نمایید.
      `,
      category:`
      1. خرید، فروش، گرو و کرایه جایداد (مکان های تجارتی، رهایشی، خانه و زمین)
      2. خرید، فروش وسایل نقلیه خانگی(موتر، موتور سکلیت، بایسکل)



      `
    },

    {
      id: 'carry',
      name: 'حمل و نقل',
      image: 'delivery.png',
      imageinfo: 'حمل و نقل',
      info:`انتقال اجناس و اسناد از یک مکان به مکان دیگر یکی از مسایل مهم امروزی است، ولی اکثر مواقع اجناس و اسناد ارسالی در مسیر راه گم شده و یا به سروقت نمی رسد که باعث بروز مشکلات زیادی میگردد. "کارگر" با همکاری شرکت های معتبر حمل و نقل این مشکل را حل نموده است.
      اگر می خواهید از خدمات زیر با اطمینان بالا مستفید شوید با ما تماس بگیرید. 
      `,
      category:`
      1. انتقال اسناد، و اجناس در داخل کشور
      2. انتقال اسناد و اجناس به تمام نقاط جهان



      `
    },
    
    {
      id: 'cleaner',
      name: 'صفاکاری',
      image: 'cleaner.png',
      info:`نظافت جز ایمان است، و از طرف دیگر نظافت و پاکی باعث سلامتی می شود. اگر می خواهید محل کار و زندگی تان پاک و منظم باشد، تیم کارگر متشکل از خانم ها و اقایان در خدمت شما قرار دارد.`,
      category:`
      1. صفا کاری مراکز تجارتی
      2. صفا کاری آپارتمان ها
      3. صفا کاری محل کار
      4. صفا کاری منازل مسکونی

      


      `
    },

    {
      id: 'hairdresser',
      name: 'آریشگاه',
      image: 'hairstyle.png',
      info:`آرایش و منظم بودن سر و صورت نماد شخصیت هر فرد است، و همچنین این آرایش و منظم بود برای افراد که به دلایل مختلف به آرایشگاه رفته نمی توانند ضروری است، لذا ما نه تنها برای جوانان، داماد و عروس خدمات ارایه می نمایم، بلکه برای افراد که به آریشگاه رفته نمی توانند خدمات درب منزل نیز ارایه می نمایم. 
      برای خدمات زیر بما تماس شوید.
       `,
      category:`
      1. اصلاح، رنگ مو  
      2. اصلاح و رنگ ریش



      `
    },
    
  ];
  donors=[
    {
      id:'rm',
      name:'شرکت مشوره دهی مالی روزنه موفقیت',
      phone:'0728983429',
      email:'rm.info@gamil.com',
      image:'building.png',
      address:'گولایی دواخانه - مارکیت حکیم سنایی - منزل سوم - دفتر شماره 34',
      shortinfo:'ارایه دهنده سیستم مالی کمپیوتری، خدمات مالیاتی، راه اندازی سیستم های کپیوتری',
      details:`روزنه موفقیت با آرزوی خدمات عالی در قسمت تصفیه مالیاتی، راه اندازی سیستم مالی کمپیوتری و کلی خدمات مالی پا به بازار نهاد.
      `,
    },
    {
      id:'apex',
      name:'اپکس دیکور',
      phone:'0728983429',
      email:'apexdecor@gamil.com',
      image:'building.png',
      address:'سرک سیلو، بین سرک 3 و 4، مقابل بلاک های شاداب ظفر، مارکیت قاری محمد امین، منزل دوم',
      shortinfo:'عریضه کننده سقف کشسان، سنگ مصنوعی و انواع لوازم دیکوریشن.',
      details:`اپکس دیکور!
       فراهم کننده ی انواع سقف شکسان، کاغذ دیواری و ....
      `,
    },
    {
      id:'apex',
      name:'اپکس دیکور',
      phone:'0728983429',
      email:'apexdecor@gamil.com',
      image:'building.png',
      address:'سرک سیلو، بین سرک 3 و 4، مقابل بلاک های شاداب ظفر، مارکیت قاری محمد امین، منزل دوم',
      shortinfo:'عریضه کننده سقف کشسان، سنگ مصنوعی و انواع لوازم دیکوریشن.',
      details:`اپکس دیکور!
       فراهم کننده ی انواع سقف شکسان، کاغذ دیواری و ....
      `,
    },
    
   
  ];
  
  getItems(){
     return this.items;
  }
  filter(queryText){
    return this.items.filter(item =>{
      return item.name.indexOf(queryText)> -1;
    });
  }
  
  getItem(id){
    return this.items.filter(res=>{
      if(res.id===id){
        return res
      }
    })
  }

  getDonors(){
    return this.donors;
  }
  getDonor(id){
    return this.donors.filter(res =>{
      if(res.id===id){
        return res;
      }
    })
  }
  constructor() { }
}
